# Start of Exercise 1

# Завдання 1. Перевірка парності числа
#
# Тема: арифметичні та логічні оператори (%, ==, if)
#
# 🔹 Опис:
# Користувач вводить число.
# Твоя програма повинна визначити, чи є це число парним або непарним, і вивести результат.
#
# 🔹 Приклад роботи програми:
#
# Введіть число: 7
# 7 є непарним числом.
#
#
#

# End of exercise 1

# number = int(input("Enter your number: "))
# if number % 2 == 0:
#     print ("The number is even.")
# else:
#     print ("The number is odd.")

# Start of Exercise 2

# Завдання 2. Порівняння двох чисел
#
# Тема: оператори порівняння (>, <, ==, !=, >=, <=)
# та логічні оператори (and, or)
#
# 🔹 Опис:
# Користувач вводить два числа.
# Програма повинна:
#
# Вивести, яке з них більше / менше / чи вони рівні.
#
# Додатково перевірити, чи обидва числа додатні.
#
# 🔹 Приклад роботи:
#
# Введіть перше число: 5
# Введіть друге число: 12
# 12 більше за 5
# Обидва числа додатні
#
#
# number_1 = int(input("Enter your first number: "))
# number_2 = int(input("Enter your second number: "))
#
# if number_1 % 2 == 0 and number_2 % 2 == 0:
#      print("The numbers are Even")
# else:
#      print("The numbers are Odd")
#
# if number_1 > number_2:
#     print("The number 1 is greater then number 2")
# elif number_1 < number_2:
#     print("The number 1 is less then number 2")
# else:
#     print("The numbers are equal")

#  End of exercise 2



# # Start of Exercise 3
#
# Завдання 3. Напиши програму, яка перевіряє, чи є введений рік високосним.
#
# 📘 Правило високосного року:
#
# Рік високосний, якщо:
#
# ділиться на 4 і не ділиться на 100, або
#
# ділиться на 400.

year = int(input("Enter year: "))

if (year % 4 == 0 and year % 100 != 0) or (year % 400 ==0):
    print(year, "is a leap year.")
else:
    print (year, "is not a leap year.")


# End of exercise 3