#  Start of Exercise 1
# Завдання 1. Магазин покупок
#
# Опис:
# Створи список покупок і виконай кілька операцій з ним.
#
# Інструкція:
#
# Створи список shopping_list, який містить 5 речей (наприклад: "хліб", "молоко", "яйця", "сир", "яблука").
#
# Додай у список ще один елемент — "кава".
#
# Видали зі списку "сир".
#
# Замінити "молоко" на "кефір".
#
# Виведи на екран фінальний список покупок.
#
# Очікуваний результат (приклад):
#
# ['хліб', 'кефір', 'яйця', 'яблука', 'кава']

# shopping_list = ["bread", "milk", "eggs", "cheese", "apple"]
# shopping_list.append("cofee")
# shopping_list.remove("cheese")
# shopping_list[1] = "kefir"
#
# print(shopping_list)

#  End of exercise 1
#
#
#
#  Start of Exercise 2
# Завдання 2. Середнє арифметичне оцінок
#
# Опис:
# Підрахуй середнє значення з оцінок учня, використовуючи список чисел.
#
# Інструкція:
#
# Створи список grades = [12, 8, 10, 11, 9].
#
# Обчисли середнє арифметичне (сума всіх оцінок / кількість оцінок).
#
# Виведи результат у форматі:
#
# Середня оцінка: 10.0

# grades = [12, 8, 10, 11, 9]
# average = sum(grades)/len(grades)
# print(average)

#  End of exercise 2
#
#
#  Start of Exercise 3
# Завдання 3. Робота з улюбленими фільмами
#
# Опис:
# Практика індексації, зрізів і перевірки елементів у списку.
#
# Інструкція:
#
# Створи список movies із назвами 5 твоїх улюблених фільмів.
#
# Виведи перший і останній фільм у списку.
#
# Виведи 3 перших фільми за допомогою зрізу (movies[:3]).
#
# Запитай користувача про фільм через input() і перевір, чи він є у списку:
#
# Якщо є → виведи "Фільм є у списку!"
#
# Якщо немає → виведи "Такого фільму немає у списку."
#
# movies = ["alone at home", "mask", "batman", "friends", "2012"]
# print ( movies[0] )
# print ( movies[4] )
# print ( movies[:3] )
#
# print ("            ")
#
# movie = input("Enter your favorite movie:")
# # print("Your favorite movie is:", movie)
# if movie in movies:
#     print("Movie is at list")
# else:
#     print("Movie is not in list")
#  End of exercise 3