#  Start of Exercise 1
# Завдання 1 — Функція, що перевіряє парність числа
#
# Опис:
# Напиши функцію is_even(n), яка приймає число і повертає True, якщо воно парне, і False, якщо непарне.
# Потім виклич цю функцію в циклі для чисел з 1 до 20.
#
# Приклад очікуваного виводу:
#
# 1 -> False
# 2 -> True
# 3 -> False
# 4 -> True
# ...

# End of exercise 1

#  Start of Exercise 2
# Завдання 2 — Функція, що рахує кількість голосних у рядку
#
# Опис:
# Створи функцію count_vowels(text), яка рахує кількість голосних літер у рядку (a, e, i, o, u).
# Функція має повертати число.
#
# Потім виклич її на кількох прикладах:
#
# "hello"
# "python"
# "beautiful day"
#
#
# Підказка: використовуй цикл for і оператор in.

#  End of exercise 2


#  Start of Exercise 3
# Завдання 3 — Функція, що повертає найбільше число зі списку
#
# Опис:
# Реалізуй функцію my_max(numbers), яка не використовує вбудований max(), а сама знаходить найбільший елемент списку.
#
# Функція:
#
# приймає список чисел
#
# проходить його циклом
#
# повертає максимальне значення
#
# Потім протестуй її:
#
# print(my_max([3, 7, 1, 9, 4]))
# print(my_max([-5, -2, -10]))
#
#
# Очікування:
#
# 9
# -2


# End of exercise 3