# # # # Start of Exercise 1
# # # # Завдання 1. Калькулятор настрою
# # #
# # # Мета: попрактикувати змінні, введення даних, арифметику та print().
# # #
# # # Опис:
# # # Напиши програму, яка:
# # #
# # # Запитує в користувача два числа.
# # #
# # # Обчислює їх суму, різницю, добуток і частку.
# # #
# # # Виводить усі результати в зрозумілому форматі.
# # #
# # # Приклад:
# # #
# # # Введи перше число: 8
# # # Введи друге число: 2
# # # Сума: 10
# # # Різниця: 6
# # # Добуток: 16
# # # Частка: 4.0
# # x=5
# # y=3
# # add=x+y
# # subtract=x-y
# # multiply=x*y
# # divide=x/y
# # print(add)
# # print(subtract)
# # print(multiply)
# # print(divide)
# #
# # #End of Exercise 1
#


# # Start of Exercise 2
# # Завдання 2. Привітання з ім’ям
# #
# # Мета: використати змінні, рядки, конкатенацію (або f-рядки).
# #
# # Опис:
# # Програма запитує ім’я користувача і виводить привітання.
# #
# # Приклад:
# #
# # Введи своє ім’я: Оля
# # Привіт, Оля! Гарного дня 😊
# name=('Sviatoslav')
# print(name)
# print("Hello, Sviatoslav! Have a nice day")
#
# #End of Exercise 2



#  Start of Exercise 3
# Завдання 3. Парне чи непарне
#
# Мета: перевірити розуміння умовних операторів (if, else) та відступів.
#
# Опис:
# Напиши програму, яка:
#
# Запитує у користувача число.
#
# Визначає, чи воно парне, чи непарне.
#
# Виводить результат.
#
# Приклад:
#
# Введи число: 7
# Це непарне число.
number=7

# Check if the number is even
if number % 2 != 0:
    print("The number is odd")
else:
    print("The number is even")

# #End of Exercise 3