# # # Start of Exercise 1
# # # Завдання 1: Привітання користувача
# # #
# # # Опис:
# # # Напиши програму, яка виводить привітання з ім’ям користувача.
# # #
# # # Приклад роботи:
# # #
# # # Введи своє ім'я: Марія
# # # Привіт, Марія! Гарного дня!
# # name="Sviatoslav"
# #
# # print(f"Hello,{name}! Have a nice day!") ### f перед лапками означає format string (форматований рядок)
# # #End of Exercise 1
#
#
# # Start of Exercise 2
# # Завдання 2: Форматований вивід
# #
# # Опис:
# # Напиши програму, яка виводить інформацію про товар у форматованому вигляді.
# #
# # Вихідні дані:
# #
# # product = "Ноутбук"
# # price = 25999.99
# # quantity = 3
# product="laptop"
# price=25999.99
# quantity=3
#
# print(f"{product}, {price}, {quantity}")
# #End of Exercise 2


# Start of Exercise 3
# Завдання 3: Малюнок за допомогою print()
#
# Опис:
# Створи просту фігуру з символів за допомогою кількох викликів print().
#
# Приклад (трикутник):
#
# *
# **
# ***
# ****
# *****
#
#
# Додатково (для бажаючих):
# Зроби так, щоб кількість рядків вводив користувач.

number1="******"
number2="*******"

print("*")
print("**")
print("***")
print("****")
print("*****")
print(f"{number1}")
print(f"{number2}")

#End of Exercise 3