# # # Start of Exercise 1
# # """
# # Завдання 1: Привітання з коментарями
# #
# # Мета: навчитися додавати коментарі до простого коду.
# #
# # 🔹 Завдання:
# # Напиши програму, яка виводить на екран твоє ім’я та вік.
# # Додай коментарі, які пояснюють кожен рядок коду.
# # """
#
# # name="Sviatoslav" # my name
# # age=34 # my age
#
# # print("My name is", name, "and I am", age, "years old") # output variant 1
# # print(f"My name is {name} and I am {age} years old")  # output variant 2 f перед лапками означає format string (форматований рядок)
#
# # # End of Exercise 1
#
#
# # Start of Exercise 2
# """
# Завдання 2: Коментарі до обчислень
#
# Мета: навчитися пояснювати арифметичні дії коментарями.
#
# 🔹 Завдання:
# Напиши програму, яка обчислює суму, різницю, добуток і частку двох чисел.
# Перед кожним обчисленням додай пояснювальний коментар.
# """
#
# x=6
# y=3
# add=x+y #addition
# sub=x-y #subtraction
# mul=x*y #multiplication
# div=x/y #division
#
# print(add,sub,mul,div)
# # End of Exercise 2


#  Start of Exercise 3
"""
Завдання 3: Коментар як підказка

Мета: навчитися використовувати коментарі для опису майбутніх кроків.

🔹 Завдання:
Створи програму, яка поки що тільки має коментарі з описом того, що вона буде робити.
(Код поки не потрібно писати.)
"""

# 1 write variable
# 2 Check if the number is even ( if number % 2 != 0: )
# 3 Output result "The number is odd" or "The number is even"

# End of Exercise 3