# # # Start of Exercise 1
# # """
# # Завдання 1: Привітання користувача
# #
# # Мета: закріпити створення змінних і виведення на екран.
# #
# # Умова:
# # Створи три змінні:
# #
# # name — ім’я користувача
# #
# # age — його вік
# #
# # city — місто, де він живе
# #
# # Виведи повідомлення:
# #
# # Привіт, мене звати [ім'я]. Мені [вік] років, я живу у [місто].
# # """
# # name="Sviatoslav"
# # age=34
# # city="Lviv"
# # print (f"Hello, my name is {name}. I am {age} years old, and I live in {city}.")
# #
# # # End of Exercise 1
#
#
# # Start of Exercise 2
# """
# Завдання 2: Обчислення площі прямокутника
#
# Мета: використовувати змінні для зберігання чисел і математичних операцій.
#
# Умова:
# Створи дві змінні:
#
# length (довжина)
#
# width (ширина)
#
# Обчисли площу прямокутника за формулою:
#
# area = length * width
#
#
# Виведи результат у вигляді:
#
# Площа прямокутника = [значення]
# """
# lenght=50
# weight=35
#
# area = lenght*weight
# print (f"Area of the rectangle = {area} ")
#
# # End of Exercise 2

# Start of Exercise 3
"""
Завдання 3: Обмін значень між змінними

Мета: навчитися змінювати значення між двома змінними.

Умова:
Є дві змінні:

a = 5
b = 10

Після обміну має бути:

a = 10
b = 5

Зроби це без створення третьої змінної.
"""
a = 5
b = 10

def myfunk():
    a = 10
    b = 5
    print (f" a = {a} \n b = {b} ")
myfunk()
# End of Exercise 3

