# # Start of Exercise 1
# # Завдання 1. Переведення типів даних
# #
# # Опис:
# # Користувач вводить два числа — одне ціле (int), а друге з плаваючою комою (float).
# # Перетвори обидва значення у тип int і обчисли їх суму.
# #
# # Приклад роботи:
# #
# # Введіть ціле число: 7
# # Введіть десяткове число: 3.9
# # Сума після перетворення у int: 10
#
# x = 7
# y = 3.9
# print(int(x) + int(y))

# End of Exercise 1

# Start of Exercise 2
# Завдання 2: Конвертація між типами
#
# Рівень: середній
#
# Опис:
# Створи змінну num = 5.75.
#
# Перетвори її у ціле число (int)
#
# Перетвори це число у рядок (str)
#
# Виведи на екран тип кожного етапу (type())
#
# Очікуваний результат:
#
# Початкове значення: 5.75 <class 'float'>
# Після int(): 5 <class 'int'>
# Після str(): "5" <class 'str'>

# num = 5.75 # float
#
# num = int(num) # int
# print ((num), (type(num)))
#
# num = str(num) # str
# print ((num), (type(num)))

# End of Exercise 2

# Start of Exercise 3
# Завдання 3: Форматований вивід з конвертацією
#
# Рівень: трохи складніший
#
# Опис:
# Користувач вводить свій вік (рядком).
# Програма повинна:
#
# Перетворити введення в число.
#
# Обчислити, скільки років буде через 10 років.
#
# Вивести результат у форматованому рядку.
#
# Приклад:
#
# # Введи свій вік: 25
# Через 10 років тобі буде 35 років!

# age = input("Enter your age: ")
#
# print (f"From 10 yers you will be {int(age)+10} yers")
# End of Exercise 3