# # Start of Exercise 1
# # Завдання 1. Персональне привітання
#
# Опис:
# Напиши програму, яка запитує в користувача його ім’я, прізвище та вік, а потім виводить повідомлення у форматі:
#
# Привіт, [Ім’я Прізвище]! Тобі [вік] років.
#
#
# Вимоги:
#
# Використай input() для введення даних.
#
# Об’єднай рядки різними способами:
#
# конкатенацією (+),
#
# f-рядком,
#
# методом .format().
#
# Порівняй, який варіант зручніший.
#
# name = input("Enter your name: ")
# last_name = input("Enter your last name: ")
# age = int(input("Enter your age: "))
#
# print ("hello, " + name + " " + last_name + " " + str(age))
# print (f"Hello, {name} {last_name} {age}")
# print ( "Hello, {name} {last_name} {age} ." .format(name = name, last_name = last_name, age = age) )

# End of exercise 1

# Start of Exercise 2
# 🧩 Завдання 2. Аналіз тексту
#
# Опис:
# Створи змінну text, у яку запиши будь-яке речення (наприклад, "Python is an amazing programming language").
# Виведи на екран наступну інформацію:
#
# Довжину рядка.
#
# Тільки перші 6 символів.
#
# Рядок у верхньому та нижньому регістрі.
#
# Кількість входжень літери "a".
#
# Чи починається рядок зі слова "Python"?
#
# Підказка:
# Використай методи: .upper(), .lower(), .count(), .startswith(), зрізи [:], і функцію len().

# txt = ("Python is an amazing programming language. ")
#
# print (len(txt))
# print (txt[:7])
# print (txt.upper())
# print (txt.lower())
# print (txt.count("a"))
#
# if txt .startswith("Python"):
#     print ("String starts with 'Python'")

# End of exercise 2

# Start of Exercise 3
# 🧩 Завдання 3. Форматування повідомлення
#
# Опис:
# Є три змінні:
#
# product = "laptop"
# price = 18500
# discount = 15
#
#
# Напиши програму, яка формує повідомлення:
#
# Товар: laptop | Ціна зі знижкою 15%: 15725.0 грн
#
#
# Вимоги:
#
# Обчисли знижку програмно.
#
# Використай f-string для форматування тексту.
#
# Додай вирівнювання або округлення ціни до двох знаків після коми.

product = "laptop"
price = 18500
discount = 15

final_price = price - (price * discount /100 )
print( f"Price after discount: {final_price:.2f}" )

# priceAfterDiscount = price

# End of Exercise 3
